Revit 2024 API
ConnectorElement.ChangeHostReference Method
Overload List
Name | Description
ChangeHostReference(Reference)
 Changes the connector host reference to a new planar face.
ChangeHostReference(Reference, Edge)
 Changes the connector host reference to a new planar face and a new edge loop.
See Also
ConnectorElement Class
ConnectorElement Members
Autodesk.Revit.DB Namespace